from django.contrib import admin

from .forms import PatientForm
from .models import Patient, PatientMedication


# =========================================================
# نمایش داروها داخل صفحه بیمار
#
# با این Inline می‌توانیم داروهای هر بیمار را
# مستقیماً داخل صفحه همان بیمار اضافه کنیم.
# =========================================================

class PatientMedicationInline(admin.TabularInline):

    # مدلی که قرار است داخل بیمار نمایش داده شود
    model = PatientMedication

    # یک ردیف خالی برای اضافه کردن داروی جدید
    extra = 1


# =========================================================
# تنظیمات پنل مدیریت بیمار
# =========================================================

@admin.register(Patient)
class PatientAdmin(admin.ModelAdmin):

    # -----------------------------------------------------
    # استفاده از فرم سفارشی بیمار
    #
    # باعث می‌شود تاریخ‌ها در Admin نیز به صورت شمسی
    # دریافت و سپس به تاریخ میلادی تبدیل شوند.
    # -----------------------------------------------------

    form = PatientForm

    # -----------------------------------------------------
    # داروهای بیمار را داخل صفحه بیمار نمایش می‌دهیم.
    # -----------------------------------------------------

    inlines = [
        PatientMedicationInline
    ]

    # -----------------------------------------------------
    # فیلدهایی که در لیست بیماران نمایش داده می‌شوند.
    # -----------------------------------------------------

    list_display = [
        "id",
        "age",
        "gender",
        "psychiatric_diagnosis",
        "treatment_start_date",
        "last_medication_change",
        "created_at",
    ]

    # -----------------------------------------------------
    # امکان جستجو در بیماران
    # -----------------------------------------------------

    search_fields = [
        "psychiatric_diagnosis",
    ]

    # -----------------------------------------------------
    # فیلتر سمت راست پنل
    # -----------------------------------------------------

    list_filter = [
        "gender",
        "diabetes",
        "hypertension",
        "obesity",
        "cardiovascular_disease",
    ]


# =========================================================
# تنظیمات پنل مدیریت دارو
# =========================================================

@admin.register(PatientMedication)
class PatientMedicationAdmin(admin.ModelAdmin):

    # فیلدهای نمایش داده شده در لیست داروها
    list_display = [
        "patient",
        "drug",
        "dose",
        "form",
    ]

    # امکان فیلتر کردن داروها
    list_filter = [
        "drug",
        "form",
    ]

    # امکان جستجو بر اساس بیمار
    search_fields = [
        "patient__psychiatric_diagnosis",
    ]